# Exploring the MovieLens 1M Dataset

#### Extrated (and slightly modified) from *Python for Data Analysis (Wes McKinney)*

This dataset contains 1 million ratings collected from 6000 users on 4000 movies, and it is organized into three tables:


*   Ratings
*   Users
*   Movie information

Each table is available as a separate file, each containing a series of rows where columns are separated by *::*


[Download the dataset here](http://files.grouplens.org/datasets/movielens/ml-1m.zip)

This example illustrates a series of interesting things that we can learn from this dataset. Most operations will be performed using the pandas library. For more details, please refer to *Python for Data Analysis - page 26*.

## **Code**

Let's begin by importing pandas. It is conventional to use *pd* to denote pandas

In [1]:
import pandas as pd

Next we will import each of the three tables and assign names to each of the columns:

In [3]:
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']
users = pd.read_table('ml-1m/users.dat', sep='::', header=None, names=unames, engine='python', encoding='latin-1')

In [4]:
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table('ml-1m/ratings.dat', sep='::', header=None, names=rnames, engine='python', encoding='latin-1')

In [5]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('ml-1m/movies.dat', sep='::', header=None, names=mnames, engine='python', encoding='latin-1')

Let's take a look at the first 5 rows of each table:

In [6]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [7]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [8]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

Having all information spread across different tables makes it much more dificult to analyse the data. Using pandas's merge function, we first merge ratings with users then we merge that result with the movies data. pandas infers which columns to
use as the merge (or join) keys based on overlapping names:

In [9]:
data = pd.merge(pd.merge(ratings, users), movies)

Below is the first row in that dataset

In [10]:
data.head(1)

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama

In this form, aggregating the ratings grouped by one or more user or movie characteristics is straightforward once you build some familiarity with pandas. To get mean movie ratings for each film grouped by gender, we can use the pivot_table method:

In [11]:
mean_ratings = data.pivot_table('rating', index='title', columns='gender', aggfunc='mean')

In [12]:
mean_ratings[:5]

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

If we wish to only look at movies that received more than a certain number of ratings, we can group them as follows (here using 250 ratings):

In [13]:
ratings_by_title = data.groupby('title').size()

In [14]:
ratings_by_title[:5]

title
$1,000,000 Duck (1971)            37
'Night Mother (1986)              70
'Til There Was You (1997)         52
'burbs, The (1989)               303
...And Justice for All (1979)    199
dtype: int64

Let's now grab the titles of movies that were rated more than 250 times:

In [15]:
active_titles = ratings_by_title.index[ratings_by_title >= 250]

In [16]:
active_titles[:5]

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)',
       '12 Angry Men (1957)'],
      dtype='object', name='title')

The index of titles receiving at least 250 ratings can then be used to select rows from mean_ratings above:

In [23]:
mean_ratings = mean_ratings.loc[active_titles]

In [24]:
mean_ratings[:5]

gender                                    F         M
title
'burbs, The (1989)                 2.793478  2.962085
10 Things I Hate About You (1999)  3.646552  3.311966
101 Dalmatians (1961)              3.791444  3.500000
101 Dalmatians (1996)              3.240000  2.911215
12 Angry Men (1957)                4.184397  4.328421

To see the top films among female viewers, we can sort by the F column in descending order:

In [25]:
top_female_ratings = mean_ratings.sort_values(by='F', ascending=False)

In [26]:
top_female_ratings[:10]

gender                                                     F         M
title
Close Shave, A (1995)                               4.644444  4.473795
Wrong Trousers, The (1993)                          4.588235  4.478261
Sunset Blvd. (a.k.a. Sunset Boulevard) (1950)       4.572650  4.464589
Wallace & Gromit: The Best of Aardman Animation...  4.563107  4.385075
Schindler's List (1993)                             4.562602  4.491415
Shawshank Redemption, The (1994)                    4.539075  4.560625
Grand Day Out, A (1992)                             4.537879  4.293255
To Kill a Mockingbird (1962)                        4.536667  4.372611
Creature Comforts (1990)                            4.513889  4.272277
Usual Suspects, The (1995)                          4.513317  4.518248

Likewise, for males:

In [27]:
top_male_ratings = mean_ratings.sort_values(by='M', ascending=False)

In [28]:
top_male_ratings[:10]

gender                                                     F         M
title
Godfather, The (1972)                               4.314700  4.583333
Seven Samurai (The Magnificent Seven) (Shichini...  4.481132  4.576628
Shawshank Redemption, The (1994)                    4.539075  4.560625
Raiders of the Lost Ark (1981)                      4.332168  4.520597
Usual Suspects, The (1995)                          4.513317  4.518248
Star Wars: Episode IV - A New Hope (1977)           4.302937  4.495307
Schindler's List (1993)                             4.562602  4.491415
Wrong Trousers, The (1993)                          4.588235  4.478261
Close Shave, A (1995)                               4.644444  4.473795
Rear Window (1954)                                  4.484536  4.472991

Suppose you wanted to find the movies that are most divisive between male and female viewers. One way is to add a column to *mean_ratings* containing the difference in means, then sort by that:

In [29]:
mean_ratings['diff'] = mean_ratings['M'] - mean_ratings['F']

Sorting by 'diff' gives us the movies with the greatest rating difference and which were preferred by women:

In [30]:
sorted_by_diff = mean_ratings.sort_values(by='diff')

In [31]:
sorted_by_diff[:10]

gender                                        F         M      diff
title
Dirty Dancing (1987)                   3.790378  2.959596 -0.830782
Jumpin' Jack Flash (1986)              3.254717  2.578358 -0.676359
Grease (1978)                          3.975265  3.367041 -0.608224
Little Women (1994)                    3.870588  3.321739 -0.548849
Steel Magnolias (1989)                 3.901734  3.365957 -0.535777
Anastasia (1997)                       3.800000  3.281609 -0.518391
Rocky Horror Picture Show, The (1975)  3.673016  3.160131 -0.512885
Color Purple, The (1985)               4.158192  3.659341 -0.498851
Age of Innocence, The (1993)           3.827068  3.339506 -0.487561
Free Willy (1993)                      2.921348  2.438776 -0.482573

Reversing the order of the rows and again slicing off the top 10 rows, we get the movies preferred by men that women didn’t rate highly:

In [32]:
sorted_by_diff[::-1][:10]

gender                                         F         M      diff
title
Good, The Bad and The Ugly, The (1966)  3.494949  4.221300  0.726351
Kentucky Fried Movie, The (1977)        2.878788  3.555147  0.676359
Dumb & Dumber (1994)                    2.697987  3.336595  0.638608
Longest Day, The (1962)                 3.411765  4.031447  0.619682
Cable Guy, The (1996)                   2.250000  2.863787  0.613787
Evil Dead II (Dead By Dawn) (1987)      3.297297  3.909283  0.611985
Hidden, The (1987)                      3.137931  3.745098  0.607167
Rocky III (1982)                        2.361702  2.943503  0.581801
Caddyshack (1980)                       3.396135  3.969737  0.573602
For a Few Dollars More (1965)           3.409091  3.953795  0.544704

## Assignment Extension

1. [10 pts] The mean of movie ratings by men of age above 25 for each particular genre,
e.g., Action, Adventure, Drama, Science Fiction, ... Note, Action|Drama|Thriller’ is
not considered a unique genre. The movie that has a genre like this belongs to all three
genres.

In [36]:
# STEP 1: Filter dataset to include only ratings from male users over 25
# --------------------------------------------------------------------------------
# Filter by age > 25
data_filtered_age = data[data['age'] > 25]
# Filter by gender == 'M'
data_filtered_age_male = data_filtered_age[data_filtered_age['gender'] == 'M']

In [37]:
# STEP 2: split the compound genre strings into individual genres
# --------------------------------------------------------------------------------
# create a copy of the filtered data to avoid modifying the original
genre_ratings = data_filtered_age_male.copy()
# split the genres into a list
genre_ratings['genres'] = genre_ratings['genres'].str.split('|')

In [38]:
# STEP 3: Associate each rating with the corresponding genre
# --------------------------------------------------------------------------------
genre_ratings = genre_ratings.explode('genres')

In [43]:
# STEP 4: calculate the mean rating for each individual genre
# --------------------------------------------------------------------------------
genre_ratings_mean = genre_ratings.groupby('genres')['rating'].mean().sort_values(ascending=False)

genre_ratings_mean

# Step 5: shout for joy

genres
Film-Noir      4.117140
Documentary    3.950192
War            3.940634
Drama          3.812309
Crime          3.764249
Mystery        3.759347
Animation      3.721569
Western        3.708494
Musical        3.700242
Romance        3.659748
Thriller       3.644025
Comedy         3.565456
Action         3.554547
Adventure      3.538637
Sci-Fi         3.509693
Fantasy        3.490408
Children's     3.475314
Horror         3.241089
Name: rating, dtype: float64

2. [5 pts] The top 5 ranked movies by the most number of ratings (not the highest rating).

In [ ]:
# STEP 1: count the number of ratings for each title
# --------------------------------------------------------------------------------
# ALREADY DONE!!

# STEP 2: sort the ratings by title
# --------------------------------------------------------------------------------
sorted_ratings_by_title = ratings_by_title.sort_values(ascending=False)

In [45]:
# STEP 3: Select the top 5 movies with the most ratings
# --------------------------------------------------------------------------------
top_5_movies = sorted_ratings_by_title.head(5)
top_5_movies

title
American Beauty (1999)                                   3428
Star Wars: Episode IV - A New Hope (1977)                2991
Star Wars: Episode V - The Empire Strikes Back (1980)    2990
Star Wars: Episode VI - Return of the Jedi (1983)        2883
Jurassic Park (1993)                                     2672
dtype: int64

3. [20 pts] Average movie ratings between users of different age groups (<=18, 19-30,
31-50, 51-70, >=71)

4. [25 pts] Pick a movie of your choice and for all movies of the same year, provide a
breakdown of the number of unique movies rated by 3 ranges of age of reviewers (a)
under 18 (b) 19 to 45 (c) Above 45.

5. [20 pts] A function that takes in a user_id and a movie_id, and returns a list of all
the other movies that the user rated similarly to the given movie, i.e. with the same
rating. Demonstrate that your function works.

6. [20 pts] Some other statistic, figure, aggregate, or plot that you created using this
dataset, along with a short description of what interesting observations you derived
from it.